// Задача 56: Задайте прямоугольный двумерный массив. Напишите программу, 
// которая будет находить строку с наименьшей суммой элементов.
// Например, задан массив:

// 1 4 7 2
// 5 9 2 3
// 8 4 2 4
// 5 2 6 7

// Программа считает сумму элементов в каждой строке и выдаёт номер строки с наименьшей суммой элементов: 1 строка

int[,] CreateArray(int row, int col)
{
    int[,] arr = new int[row, col];
    for (int i = 0; i < arr.GetLength(0); i++)
    {
        for (int j = 0; j < arr.GetLength(1); j++)
        {
            arr[i, j] = new Random().Next(0, 10);
        }
    }
    return arr;
}
void PrintArray(int[,] array)
{
    for (int i = 0; i < array.GetLength(0); i++)
    {
        for (int j = 0; j < array.GetLength(1); j++)
        {
            Console.Write($"{array[i, j]} ");
        }
        Console.WriteLine();
    }
}
void CountRowSum(int[,] array)
{
    int[] rowSum = new int[array.GetLength(0)];
    int sum = 0;
    for (int i = 0; i < array.GetLength(0); i++)
    {
        for (int j = 0; j < array.GetLength(1); j++)
        {
            sum += array[i, j];
        }
        rowSum[i] = sum;
        sum = 0;
    }
    int min = rowSum[0];
    int numOfRow = 0;
    for (int k = 0; k < rowSum.Length; k++)
    {
        if (min > rowSum[k])
        {
            min = rowSum[k];
            numOfRow = k;
        }
    }
    Console.Write($"{numOfRow + 1} строка");
}
int[,] matrix = CreateArray(3, 4);
PrintArray(matrix);
Console.WriteLine();
CountRowSum(matrix);